       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVBAN.
       AUTHOR. VITOR SETRAGNI.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CAD-ENT ASSIGN TO UT-S-CADAST.
           SELECT MOV-ENT ASSIGN TO UT-S-MOVTO.
           SELECT SAL-SAIDA ASSIGN TO UT-S-SALDOS.
           SELECT LOG-SAIDA ASSIGN TO UT-S-LOGERR.
           SELECT RES-SAIDA ASSIGN TO UT-S-RESUMO.

       DATA DIVISION.
       FILE SECTION.
       FD  CAD-ENT
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 44 CHARACTERS
           DATA RECORD IS REG-CADASTRO.
       01  REG-CADASTRO.
           05  CAD-ID PIC 9(05).
           05  CAD-NOME PIC X(30).
           05  CAD-SALDO PIC 9(09).

       FD  MOV-ENT
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 20 CHARACTERS
           DATA RECORD IS REG-MOVIMENTO.
       01  REG-MOVIMENTO.
           05  MOV-CLI-ID PIC 9(05).
           05  MOV-ID PIC 9(05).
           05  MOV-TIPO PIC X(01).
           05  MOV-VALOR PIC 9(09).

       FD  SAL-SAIDA
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 44 CHARACTERS
           DATA RECORD IS REG-NOVOSALDO.
       01  REG-NOVOSALDO.
           05  NS-ID PIC 9(05).
           05  NS-NOME PIC X(30).
           05  NS-SALDO PIC 9(09).

       FD  LOG-SAIDA
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS REG-LOG.
       01  REG-LOG PIC X(80).

       FD  RES-SAIDA
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 120 CHARACTERS
           DATA RECORD IS REG-RESUMO.
       01  REG-RESUMO PIC X(120).

       WORKING-STORAGE SECTION.
       01  FIM-CAD PIC X(01) VALUE 'N'.
       01  FIM-MOV PIC X(01) VALUE 'N'.
       01  TOT-CAD PIC 9(06) VALUE ZERO.
       01  TOT-MOV PIC 9(06) VALUE ZERO.
       01  TOT-CRED PIC 9(06) VALUE ZERO.
       01  TOT-DEB PIC 9(06) VALUE ZERO.
       01  TOT-ERR PIC 9(06) VALUE ZERO.
       01  SOMA-CRED-CAD PIC 9(09) VALUE ZERO.
       01  SOMA-DEB-CAD PIC 9(09) VALUE ZERO.

       01  LIN-LOG.
           05  FILLER PIC X(06) VALUE 'ERRO: '.
           05  LOG-MSG PIC X(40).
           05  FILLER PIC X(06) VALUE ' - ID '.
           05  LOG-ID PIC 9(05).
           05  FILLER PIC X(23) VALUE SPACES.

       01  LIN-CAD.
           05  FILLER PIC X(09) VALUE 'CLIENTE: '.
           05  RES-ID PIC 9(05).
           05  FILLER PIC X(106) VALUE SPACES.

       01  LIN-CRED.
           05  FILLER PIC X(16) VALUE 'TOTAL CREDITOS: '.
           05  RES-CRED PIC 9(09).
           05  FILLER PIC X(95) VALUE SPACES.

       01  LIN-DEB.
           05  FILLER PIC X(15) VALUE 'TOTAL DEBITOS: '.
           05  RES-DEB PIC 9(09).
           05  FILLER PIC X(96) VALUE SPACES.

       01  LIN-EST-1 PIC X(40) VALUE
           '****************************************'.
       01  LIN-EST-2 PIC X(40) VALUE
           'ESTATISTICAS DE PROCESSAMENTO'.
       01  LIN-FIM PIC X(40) VALUE
           'FIM DO PROCESSAMENTO'.
       01  LIN-SEP PIC X(120) VALUE ALL '-'.

       01  LIN-TOT-CAD.
           05  FILLER PIC X(29) VALUE 'CLIENTES PROCESSADOS.....: '.
           05  EST-CAD PIC 9(06).
           05  FILLER PIC X(85) VALUE SPACES.

       01  LIN-TOT-MOV.
           05  FILLER PIC X(29) VALUE 'TRANSACOES PROCESSADAS...: '.
           05  EST-MOV PIC 9(06).
           05  FILLER PIC X(85) VALUE SPACES.

       01  LIN-TOT-CRED.
           05  FILLER PIC X(29) VALUE 'CREDITOS PROCESSADOS.....: '.
           05  EST-CRED PIC 9(06).
           05  FILLER PIC X(85) VALUE SPACES.

       01  LIN-TOT-DEB.
           05  FILLER PIC X(29) VALUE 'DEBITOS PROCESSADOS......: '.
           05  EST-DEB PIC 9(06).
           05  FILLER PIC X(85) VALUE SPACES.

       01  LIN-TOT-ERR.
           05  FILLER PIC X(29) VALUE 'ERROS ENCONTRADOS........: '.
           05  EST-ERR PIC 9(06).
           05  FILLER PIC X(85) VALUE SPACES.

       PROCEDURE DIVISION.
       0000-PRINCIPAL.
           OPEN INPUT CAD-ENT.
           OPEN INPUT MOV-ENT.
           OPEN OUTPUT SAL-SAIDA.
           OPEN OUTPUT LOG-SAIDA.
           OPEN OUTPUT RES-SAIDA.
           PERFORM 0100-LER-CAD.
           PERFORM 0200-LER-MOV.
           PERFORM 0300-PROCESSAR
           UNTIL FIM-CAD = 'S' AND FIM-MOV = 'S'.
           PERFORM 0900-ESTATISTICAS.
           CLOSE CAD-ENT MOV-ENT SAL-SAIDA.
           CLOSE LOG-SAIDA RES-SAIDA.
           STOP RUN.

       0100-LER-CAD.
           READ CAD-ENT
           AT END MOVE 'S' TO FIM-CAD.

       0200-LER-MOV.
           READ MOV-ENT
           AT END MOVE 'S' TO FIM-MOV.

       0300-PROCESSAR.
           IF FIM-CAD = 'S' GO TO 0310-MOV-SEM-CAD.
           IF FIM-MOV = 'S' GO TO 0320-CAD-SEM-MOV.
           IF CAD-ID < MOV-CLI-ID GO TO 0320-CAD-SEM-MOV.
           IF CAD-ID > MOV-CLI-ID GO TO 0310-MOV-SEM-CAD.
           PERFORM 0400-PROCESSA-CAD.
           GO TO 0390-FIM.
       0310-MOV-SEM-CAD.
           PERFORM 0600-MOV-SEM-CAD.
           GO TO 0390-FIM.
       0320-CAD-SEM-MOV.
           PERFORM 0500-GRAVA-SALDO.
       0390-FIM.
           EXIT.

       0400-PROCESSA-CAD.
           MOVE ZERO TO SOMA-CRED-CAD.
           MOVE ZERO TO SOMA-DEB-CAD.
           PERFORM 0410-PROCESSA-MOV
           UNTIL FIM-MOV = 'S'
           OR MOV-CLI-ID NOT EQUAL TO CAD-ID.
           PERFORM 0460-GERA-RES-CAD.
           PERFORM 0500-GRAVA-SALDO.

       0410-PROCESSA-MOV.
           ADD 1 TO TOT-MOV.
           IF MOV-VALOR = ZERO GO TO 0415-VALOR-ZERO.
           IF MOV-TIPO = 'C' GO TO 0420-CREDITO.
           IF MOV-TIPO = 'D' GO TO 0430-DEBITO.
           PERFORM 0710-LOG-TIPO.
           PERFORM 0200-LER-MOV.
           GO TO 0490-FIM.
       0415-VALOR-ZERO.
           PERFORM 0720-LOG-VALOR.
           PERFORM 0200-LER-MOV.
           GO TO 0490-FIM.
       0420-CREDITO.
           ADD MOV-VALOR TO CAD-SALDO.
           ADD MOV-VALOR TO SOMA-CRED-CAD.
           ADD 1 TO TOT-CRED.
           PERFORM 0200-LER-MOV.
           GO TO 0490-FIM.
       0430-DEBITO.
           IF CAD-SALDO < MOV-VALOR GO TO 0435-SALDO-ERRO.
           SUBTRACT MOV-VALOR FROM CAD-SALDO.
           ADD MOV-VALOR TO SOMA-DEB-CAD.
           ADD 1 TO TOT-DEB.
           PERFORM 0200-LER-MOV.
           GO TO 0490-FIM.
       0435-SALDO-ERRO.
           PERFORM 0730-LOG-SALDO.
           PERFORM 0200-LER-MOV.
       0490-FIM.
           EXIT.

       0460-GERA-RES-CAD.
           MOVE CAD-ID TO RES-ID.
           MOVE LIN-CAD TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
           MOVE SOMA-CRED-CAD TO RES-CRED.
           MOVE LIN-CRED TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
           MOVE SOMA-DEB-CAD TO RES-DEB.
           MOVE LIN-DEB TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
           MOVE LIN-SEP TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.

       0500-GRAVA-SALDO.
           MOVE CAD-ID TO NS-ID.
           MOVE CAD-NOME TO NS-NOME.
           MOVE CAD-SALDO TO NS-SALDO.
           WRITE REG-NOVOSALDO.
           ADD 1 TO TOT-CAD.
           PERFORM 0100-LER-CAD.

       0600-MOV-SEM-CAD.
           ADD 1 TO TOT-MOV.
           PERFORM 0700-LOG-CLIENTE.
           PERFORM 0200-LER-MOV.

       0700-LOG-CLIENTE.
           MOVE 'CLIENTE NAO ENCONTRADO' TO LOG-MSG.
           MOVE MOV-CLI-ID TO LOG-ID.
           PERFORM 0750-GRAVA-LOG.

       0710-LOG-TIPO.
           MOVE 'TIPO DE TRANSACAO INVALIDO' TO LOG-MSG.
           MOVE MOV-CLI-ID TO LOG-ID.
           PERFORM 0750-GRAVA-LOG.

       0720-LOG-VALOR.
           MOVE 'VALOR DE TRANSACAO INVALIDO' TO LOG-MSG.
           MOVE MOV-CLI-ID TO LOG-ID.
           PERFORM 0750-GRAVA-LOG.

       0730-LOG-SALDO.
           MOVE 'SALDO INSUFICIENTE' TO LOG-MSG.
           MOVE MOV-CLI-ID TO LOG-ID.
           PERFORM 0750-GRAVA-LOG.

       0750-GRAVA-LOG.
           MOVE LIN-LOG TO REG-LOG.
           WRITE REG-LOG.
           ADD 1 TO TOT-ERR.

       0800-GRAVA-RESUMO.
           DISPLAY REG-RESUMO.
           WRITE REG-RESUMO.

       0900-ESTATISTICAS.
           MOVE LIN-EST-1 TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
           MOVE LIN-EST-2 TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
           MOVE LIN-EST-1 TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
           MOVE TOT-CAD TO EST-CAD.
           MOVE LIN-TOT-CAD TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
           MOVE TOT-MOV TO EST-MOV.
           MOVE LIN-TOT-MOV TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
           MOVE TOT-CRED TO EST-CRED.
           MOVE LIN-TOT-CRED TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
           MOVE TOT-DEB TO EST-DEB.
           MOVE LIN-TOT-DEB TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
           MOVE TOT-ERR TO EST-ERR.
           MOVE LIN-TOT-ERR TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
           MOVE LIN-FIM TO REG-RESUMO.
           PERFORM 0800-GRAVA-RESUMO.
