//COMPMOV JOB (PROG5),'COMPILA P5',CLASS=A,MSGCLASS=H,
//             MSGLEVEL=(1,1),NOTIFY=HERC01,REGION=2048K
//*
//* JCL AUXILIAR PARA COMPILAR E LINKEDITAR MOVBAN
//*
//COB      EXEC PGM=IKFCBL00,PARM='LIB,LOAD,SIZE=2048K'
//SYSPRINT DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSLIB   DD DSN=HERC01.P5COBOL,DISP=SHR
//SYSIN    DD DSN=HERC01.P5COBOL(MOVBAN),DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSUT2   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSUT3   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSUT4   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSLIN   DD DSN=&&LOADSET,DISP=(MOD,PASS),
//            UNIT=SYSDA,SPACE=(80,(500,100))
//*
//LKED     EXEC PGM=IEWL,PARM='LIST,XREF,LET',COND=(5,LT,COB)
//SYSLIN   DD DSN=&&LOADSET,DISP=(OLD,DELETE)
//SYSLIB   DD DSN=SYS1.COBLIB,DISP=SHR
//SYSLMOD  DD DSN=HERC01.P5LOAD(MOVBAN),DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(1024,(50,20))
//SYSPRINT DD SYSOUT=*
//
