//EXEMOV  JOB (PROG5),'PROJETO 5',CLASS=A,MSGCLASS=H,
//             REGION=2048K,TIME=1440,MSGLEVEL=(1,1),
//             NOTIFY=HERC01
//*
//* PROJETO 5 - EXECUTA MOVBAN
//* MESMA LOGICA, NOMES DIFERENTES
//*
//LIMPSAI  EXEC PGM=IEFBR14
//D1       DD DSN=HERC01.P5SALDOS,DISP=(MOD,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(1,1))
//D2       DD DSN=HERC01.P5LOGERR,DISP=(MOD,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(1,1))
//D3       DD DSN=HERC01.P5RESBAN,DISP=(MOD,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(1,1))
//*
//RODCOB   EXEC PGM=MOVBAN
//STEPLIB  DD DSN=HERC01.P5LOAD,DISP=SHR
//CADAST   DD DSN=HERC01.P5CADCLI,DISP=SHR
//MOVTO    DD DSN=HERC01.P5MOVTRX,DISP=SHR
//SALDOS   DD DSN=HERC01.P5SALDOS,DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(5,5)),
//            DCB=(RECFM=FB,LRECL=44,BLKSIZE=4400)
//LOGERR   DD DSN=HERC01.P5LOGERR,DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(5,5)),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=4000)
//RESUMO   DD DSN=HERC01.P5RESBAN,DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(5,5)),
//            DCB=(RECFM=FB,LRECL=120,BLKSIZE=6000)
//SYSOUT   DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//
